<?php

namespace Modules\Product\Database\factories;

use Illuminate\Database\Eloquent\Factories\Factory;
use Illuminate\Support\Arr;
use Illuminate\Support\Facades\File;
use Illuminate\Support\Facades\Storage;
use Illuminate\Support\Str;
use Modules\Product\Entities\Product;
use Modules\Product\Enums\ProductStatus;

class ProductFactory extends Factory
{
    /**
     * The name of the factory's corresponding model.
     *
     * @var string
     */
    protected $model = \Modules\Product\Entities\Product::class;

    /**
     * Define the model's default state.
     *
     * @return array
     */
    public function definition()
    {
        $name = $this->getName();
        return [
            'name' => $name.$this->faker->numerify(),
            'slug' => $this->faker->unique()->slug(),
            'price' => $this->faker->randomNumber(2, true) . '000000',
            'status' => ProductStatus::Accepted,
        ];
    }

    /**
     * @return ProductFactory|
     */
    public function rejected()
    {
        return $this->state([
            'status' => ProductStatus::Rejected
        ]);
    }

    public function gallery()
    {
        return $this->afterCreating(function (Product $product) {
            $product->media()->create([
                'files' => $this->getFile(),
                'base_url' => url('/'),
                'disk' => 'public',
                'collection' => config('product.collection_gallery'),
                'extension' => File::extension($this->getFile()['original']),
            ]);
        });
    }

    /**
     * @return array|mixed
     */
    private function getName(): mixed
    {
        return Arr::random([
            'شیر کم چرب دومینو - 1 لیتر بسته 4 عددی',
            'شیر کم چرب میهن -950 میلی لیتر',
            'شیر کم چرب کاله - 955 میلی لیتر',
            'شیر کم چرب میهن - 1 لیتر',
            'شیر کم چرب دومینو - بسته 6 عددی',
            'شیر بدون لاکتوز کاله - 1 لیتر',
            'شیر کم چرب میهن حجم 0.2 لیتر',
            'شیر کم چرب روزانه حجم 1 لیتر',
            'شیر کم چرب دومینو مقدار 1 لیتر',
            'شیر کم چرب پگاه - 946 میلی لیتر',
            'شیر کم چرب فرادما کاله- 1 لیتر',
            'شیر کم چرب بدون لاکتوز دامداران - 946 میلی لیتر',
            'شیر پاک - 800 میلی لیتر',
            'شیر برای مادران در دوران شیر دهی و بارداری ماجان کاله - 1 لیتر',
            'شیر تازه کم چرب پاک - 1 لیتر',
            'شیر کم چرب پاک - 200 میلی لیتر',
            'شیر کم چرب پروتئین - 946 میلی لیتر',
            'شیر غیر لبنی جو دوسر کاله - 1 لیتر',
            'شیر کم چرب بدون لاکتوز پاک - 1 لیتر',
            'شیر کم چرب میهن بسته 6 عددی',
            'شیر بدون لاکتوز کاله - 955 میلی لیتر',
            'شیر کم چرب آقای طبیعی - 945 میلی لیتر',
            'شیر شتر ویوان - 500 میلی لیتر بسته 6 عددی',
            'شیر کم چرب رامک - 1 لیتر',
            'شیر کم چرب بدون لاکتوز مانیزان - 950 میلی لیتر',
            'شیر کم چرب طراوت - 1 لیتر',
            'شیر کم چرب مانیزان حجم 500 میلی لیتر',
            'شیر کم چرب میهن - بسته 4 عددی',
            'شیر کم لاکتوز پگاه - 1 لیتر',
            'شیر کم چرب پگاه - 1 لیتر',
            'شیر کم چرب هراز حجم 1000 میلی لیتر',
            'شیر کم چرب صباح - 1 لیتر',
            'سوپر شیر کم چرب روزانه - 1 لیتر',
            'شیر کاکائو دومینو - 0.2 لیتر بسته 6 عددی',
            'شیر پرچرب دومینو - 1 لیتر بسته 4 عددی',
            'شیر نیم چرب ارگانیک کوهپناه مقدار 940 میلی لیتر',
            'شیر پر چرب میهن - 1 لیتر',
            'شیر کاکائو کاله - 1 لیتر',
            'شیر پر چرب میهن حجم 0.2 لیتر',
            'شیر کاکائو میهن مقدار 1 لیتر',
            'شیر پرچرب دومینو مقدار 1 لیتر',
            'شیر پرچرب مانیزان مقدار 0.95 لیتر',
            'شیر موز میهن مقدار 0.2 لیتر',
            'شیر قهوه دومینو حجم 0.2 لیتر بسته 6 عددی',
            'شیر موز میهن مقدار 1 لیتر',
            'شیر موز دومینو مقدار 0.2 لیتر بسته 6 عددی',
            'شیر پر چرب پگاه - 946 میلی لیتر',
            'شیر سویا مانداسوی با طعم کاکائو - 1 لیتر',
            'شیر پرومیلک کاله پرو با طعم وانیل - 330 میلی لیتر',
            'شیر سویا مانداسوی با طعم وانیل - 1 لیتر',
            'شیر پرچرب میهن حجم 950 میلی لیتر',
            'شیر غیرلبنی بادام کاله - 1 لیتر',
            'شیر پرومیلک کاله پرو با طعم کاکائو مقدار 330 میلی لیتر',
            'شیر بادام کاله - 200 میلی لیتر',
            'شیر پر چرب دومینو - 0.2 لیتر بسته 6 عددی',
            'شیر پر چرب کاله - 1 لیتر بسته 4 عددی',
            'شیر کاکائو کم چرب مانیزان مقدار 0.5 لیتر',
            'شیر پرچرب فرادما کاله - 1 لیتر',
            'شیر تازه پر چرب پاک حجم 1 لیتر',
            'شیر نیم چرب رامک مقدار 1 لیتر',
            'شیر پر چرب رامک - 946 میلی لیتر',
            'شیر کاکائو پگاه مقدار 0.2 لیتر',
            'شیر کاکائو پرچرب پاک مقدار 1 لیتر',
            'شیر سنتی پر چرب میهن حجم 950 میلی لیتر',
            'شیر کاکائو کم چرب مانیزان مقدار 0.95 لیتر',
            'شیر کامل میهن حجم 950 میلی لیتر',
            'شیر پر چرب میهن بسته 6 عددی',
            'شیر پرچرب مانیزان مقدار 2 لیتر',
            'شیر کاکائو رامک - 700 میلی لیتر',
            'شیر غیرلبنی فندق کاله - 1 لیتر',
            'شیر سویا کلاسیک مانداسوی - 1 لیتر',
            'شیر پرچرب سنتی و تازه پاک - 1 لیتر',
            'شیر نیم چرب فرادما پگاه - 0.2 لیتر',
            'شیر کامل ارگانیک آقای طبیعی - 945 میلی لیتر',
            'شیر قهوه مانیزان - 500 میلی لیتر',
            'شیر فندق کاله - 200 میلی لیتر',
            'شیر سویا مانداسوی با طعم طالبی - 1 لیتر',
            'شیر پرچرب رامک- 1 لیتر',
            'شیر قهوه کم چرب پگاه - 200 میلی لیتر', 'شیر سنتی دامداران - 946 میلی لیتر',
        ]);
    }

    public function getFile()
    {
        return collect(File::allFiles(public_path('/storage/products')))->map(fn($item) => [
            'original' => 'products/' . basename($item),
            '400' => 'products/400/' . basename($item),
        ])->random();
    }
}

